<?php

return [

    'error_data' => 'Помилка отримання даних',
    'test_mode' => 'Режим тестування надсилання',
    'empty_text' => 'Текст повідомлення не вказано',

    'response_status' => [
        //0
        'OK' => 'Запит оброблений успішно',

        //1
        'PONG' => 'Успішний результат виклику методу ping',

        //103
        'REQUIRED_TOKEN' => 'Немає токена автентифікації',

        //104
        'REQUIRED_CONTENT' => 'Відсутні дані запиту',

        //105
        'REQUIRED_AUTH' => 'Аутентифікацію не пройдено, неправильний токен',

        //106
        'REQUIRED_ACTIVE_USER' => 'Користувач заблокований, робота з API неможлива до розблокування',

        //200
        'REQUIRED_MESSAGE_SENDER' => 'Відсутній або порожній параметр відправника повідомлення',

        //201
        'REQUIRED_MESSAGE_TEXT' => 'Немає або порожній параметр тексту повідомлення',

        //202
        'REQUIRED_MESSAGE_RECIPIENT' => 'Немає або порожній список одержувачів повідомлення',

        //203
        'REQUIRED_BALANCE' => 'Не достатньо кредитів на балансі для створення розсилки',

        //204
        'REQUIRED_MESSAGE_BUTTON' => 'Немає або порожні параметри кнопки в повідомленні, коли вона обов\'язкова',

        //205
        'REQUIRED_MESSAGE_BUTTON_CAPTION' => 'Немає або порожній параметр тексту на кнопці в повідомленні',

        //206
        'REQUIRED_MESSAGE_BUTTON_ACTION' => 'Відсутній або порожній параметр URL адреси, куди перейде одержувач повідомлення, натиснувши кнопку',

        //300
        'INVALID_REQUEST' => 'Невірний запит, перевірте його структуру та коректність даних',

        //301
        'INVALID_TOKEN' => 'Невірний токен автентифікації',

        //302
        'INVALID_MESSAGE_SENDER' => 'Невірний відправник повідомлення',

        //303
        'INVALID_START_TIME' => 'Неправильна дата відкладеного надсилання повідомлення',

        //304
        'INVALID_MESSAGE_TEXT' => 'Неприпустиме значення тексту повідомлення. Повертається якщо передано не рядкове значення або кодування символів не входить до набору UTF-8',

        //305
        'INVALID_PHONE' => 'Неприпустимий номер одержувача, система не змогла розпізнати країну та оператора одержувача',

        //306
        'INVALID_TTL' => 'Неприпустиме значення параметра ttl, значення має бути цілим і не представлене у вигляді рядка',

        //306
        'INVALID_MESSAGE_ID' => 'Неприпустиме значення параметра message_id, неправильний формат',

        //400
        'NOT_ALLOWED_MESSAGE_SENDER' => 'Не дозволений відправник для поточного користувача',

        //401
        'NOT_ALLOWED_MESSAGE_SENDER_NOT_ACTIVE' => 'Відправник дозволено, але не активовано на даний момент (не сплачено використання в поточному місяці, не завершено реєстрацію тощо)',

        //402
        'NOT_ALLOWED_MESSAGE_IMAGE' => 'Неприпустимий тип файлу зображення',

        //403
        'NOT_ALLOWED_START_TIME' => 'Неприпустима дата відкладеного надсилання повідомлення (виходить за межі встановлених обмежень)',

        //404
        'NOT_ALLOWED_NUMBER_STOPLIST' => 'Номер одержувача знаходиться в стоп-листі (для SMS) або в ігнор-листі (для Viber), відправка неможлива',

        //405
        'NOT_ALLOWED_RECIPIENTS_LIMIT' => 'Неприпустима кількість одержувачів',

        //406
        'NOT_ALLOWED_RECIPIENT_COUNTRY' => 'Неприпустима країна отримувача. Користувач не активує можливість надсилати повідомлення одержувачам цієї країни. Щоб активувати таку можливість, зв\'яжіться з нашим відділом підтримки клієнтів',

        //407
        'NOT_ALLOWED_RECIPIENT_DUPLICATE' => 'Одержувач вже є у розсилці, дублікати ігноруються',

        //408
        'NOT_ALLOWED_MESSAGE_BUTTON_TEXT_LENGTH' => 'Текст на кнопці надто довгий, допускається не більше 30 символів',

        //409
        'NOT_ALLOWED_MESSAGE_TTL' => 'Неприпустиме значення параметра ttl (виходить за межі встановлених обмежень)',

        //410
        'NOT_ALLOWED_MESSAGE_TRANSACTION_CONTENT' => 'Неприпустимий контент у транзакційному сполученні. У таких повідомленнях можна надсилати лише текст, а кнопка та зображення заборонені',

        //411
        'NOT_ALLOWED_MESSAGE_DATA' => 'Якийсь із параметрів має неприпустиме значення, зв\'яжіться з нашим відділом підтримки клієнтів для з\'ясування деталей',

        //412
        'NOT_ALLOWED_MESSAGE_TEXT' => 'Текст містить заборонені фрагменти',

        //413
        'NOT_ALLOWED_MESSAGE_TEXT_LENGTH' => 'Перевищено допустиму довжину тексту повідомлення',

        //414
        'NOT_ALLOWED_MESSAGE_ID' => 'Дані повідомлення з надісланим message_id недоступні для поточного користувача',

        //415
        'NOT_ALLOWED_MESSAGE_TRANSACTION_SENDER' => 'Заборонено надсилати транзакційні повідомлення від загального відправника',

        //500
        'FAILED_CONVERT_RESULT2JSON' => 'Не вдалося конвертувати дані результату в формат JSON, негайно зв\'яжіться з нашим відділом підтримки клієнтів для з\'ясування деталей',

        //501
        'FAILED_CONVERT_RESULT2XML' => 'Не вдалося конвертувати дані результату в формат XML, негайно зв\'яжіться з нашим відділом підтримки клієнтів для з\'ясування деталей',

        //502
        'FAILED_PARSE_BODY' => 'Не вдалося розпізнати тіло запиту (неправильний формат)',

        //503
        'FAILED_SMS_SEND' => 'Неможливо відправити SMS повідомлення',

        //504
        'FAILED_VIBER_SEND' => 'Неможливо відправити Viber повідомлення',

        //505
        'FAILED_SAVE_IMAGE' => 'Не вдалося зберегти зображення',

        //800
        'SUCCESS_MESSAGE_ACCEPTED' => 'Повідомлення успішно створені та додані в чергу надсилання. Деякі повідомлення можуть потрапити на попередню модерацію',

        //801
        'SUCCESS_MESSAGE_SENT' => 'Повідомлення успішно надіслано',

        //802
        'SUCCESS_MESSAGE_PARTIAL_ACCEPTED' => 'Повідомлення успішно створені та додані в чергу відправки, але деякі одержувачі не потрапили до списку розсилки, деталі дивіться у відповіді',

        //803
        'SUCCESS_MESSAGE_PARTIAL_SENT' => 'Повідомлення успішно надіслано, але деякі одержувачі не потрапили до списку розсилки, деталі дивіться у відповіді',

        //999
        'FATAL_ERROR' => 'Помилка виконання запиту, зв\'яжіться з відділом підтримки для з\'ясування деталей',
    ],

];
